/***********************************************************************/
/*! @file  CSceneBase.h
 *  @brief シーンクラスベース
 *  
 *  @author 川原　佑介
 *  @date	2013/04/30
 */
/***********************************************************************/
#ifndef ___CSCENEBASE___
#define ___CSCENEBASE___	//!<	インクルードガード

/***********************************************************************/
//	インクルード
/***********************************************************************/
#include"common.h"


/***********************************************************************/
//	マクロ
/***********************************************************************/
#define CHECK_UPDATE if(!_UpdateFlg)return	//!< 更新処理判定	\n必ず更新処理の先頭に配置
#define CHECK_DRAW	 if(!_DrawFlg)return	//!< 描画処理判定	\n必ず描画処理の先頭に配置


/***********************************************************************/
/*!
 * @brift シーンクラスベース
 */
/***********************************************************************/
class CSceneBase
{
public:
	/***********************************************************************/
	//	コンストラクタ
	/***********************************************************************/
	CSceneBase();

	/***********************************************************************/
	//	デストラクタ
	/***********************************************************************/
	virtual ~CSceneBase();

	/***********************************************************************/
	//	関数
	/***********************************************************************/
	virtual void init()	   = 0;	//!<	初期化処理
	virtual void release() = 0;	//!<	解放処理
	virtual void update()  = 0;	//!<	更新処理
	virtual void draw()    = 0;	//!<	描画処理
	virtual CSceneBase* nextScene() = 0;	//!<	シーン切り替え

	void updateFlgOFF();		///<	更新処理フラグOFF
	void drawFlgOFF();			///<	描画処理フラグOFF

	void updateFlgON();			///<	更新処理フラグON
	void drawFlgON();			///<	更新処理フラグON

	const BOOL getUpdateFlg();	///<	更新処理フラグ取得
	const BOOL getDrawFlg();	///<	描画処理フラグ取得
	const BOOL getEndFlg();		///<	終了処理フラグ取得

protected:
	BOOL _UpdateFlg;			//!<	更新処理フラグ
	BOOL _DrawFlg;				//!<	描画処理フラグ
	BOOL _EndFlg;				//!<	終了処理フラグ
};

#endif