/***********************************************************************/
/*! @file  CSpriteFactory.h
 *  @brief	スプライトファクトリ
 *  
 *  @author 川原　佑介
 *  @date	
 */
/***********************************************************************/
/***********************************************************************/
//	インクルードガード
/***********************************************************************/
#pragma once

/***********************************************************************/
//	インクルード
/***********************************************************************/
#include"CTextureFactory.h"
#include"CSingleton.h"
#include<vector>
using namespace std;

/***********************************************************************/
//	先行宣言
/***********************************************************************/
class CSprite;

/***********************************************************************/
//	マクロ定義
/***********************************************************************/
#define SPRITEFACTORY CSpriteFactory::getInst()

/***********************************************************************/
//	クラス定義
/***********************************************************************/
class CSpriteFactory :public CSingleton<CSpriteFactory>
{
	friend class CSingleton<CSpriteFactory>;
private:
	CSpriteFactory();						///<	コンストラクタ
	CSpriteFactory(const CSpriteFactory&);	///<	コピーコンストラクタ
	~CSpriteFactory();						///<	デストラクタ
public:
	CSprite* create(const int nId);			///<	スプライト作成
	const BOOL	 registTexture(
		const int nId,
		const char szTexFilePath[MAX_PATH]);	///<	テクスチャの登録
};
//EOF